; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image1 - mode
	infrared0 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	Star10 - direction
	GroundStation12 - direction
	Star13 - direction
	GroundStation7 - direction
	Star2 - direction
	GroundStation1 - direction
	GroundStation6 - direction
	GroundStation11 - direction
	Star14 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Star19 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation11)
	(supports instrument1 infrared0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon17)
)
(:goal (and
	(have_image Star14 infrared0)
	(have_image Planet15 image1)
	(have_image Star16 infrared0)
	(have_image Phenomenon17 image1)
	(have_image Phenomenon18 infrared0)
	(have_image Star19 infrared0)
))

)

; plan
1. (turn_to satellite0 groundstation11 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 groundstation11)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 groundstation11)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 planet15 groundstation11)
   deleted: (pointing satellite0 groundstation11)
   added: (pointing satellite0 planet15)
   goals met: 0 of 6
5. (take_image satellite0 planet15 instrument0 image1)
   added: (have_image planet15 image1)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon18 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon18)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon18 instrument0 infrared0)
   added: (have_image phenomenon18 infrared0)
   goals met: 2 of 6
8. (turn_to satellite0 phenomenon17 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon17)
   goals met: 2 of 6
9. (take_image satellite0 phenomenon17 instrument0 image1)
   added: (have_image phenomenon17 image1)
   goals met: 3 of 6
10. (turn_to satellite0 star14 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 star14)
   goals met: 3 of 6
11. (take_image satellite0 star14 instrument0 infrared0)
   added: (have_image star14 infrared0)
   goals met: 4 of 6
12. (turn_to satellite0 star16 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star16)
   goals met: 4 of 6
13. (take_image satellite0 star16 instrument0 infrared0)
   added: (have_image star16 infrared0)
   goals met: 5 of 6
14. (turn_to satellite0 star19 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star19)
   goals met: 5 of 6
15. (take_image satellite0 star19 instrument0 infrared0)
   added: (have_image star19 infrared0)
   goals met: 6 of 6
